---
title: CutFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CutFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# CutFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCutGeometry { get; }` | `CutFailures.CannotCutGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotCutGeometryWarn { get; }` | `CutFailures.CannotCutGeometryWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOut { get; }` | `CutFailures.CannotCutInstanceOut` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOutError { get; }` | `CutFailures.CannotCutInstanceOutError` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOutGen { get; }` | `CutFailures.CannotCutInstanceOutGen` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOutGenError { get; }` | `CutFailures.CannotCutInstanceOutGenError` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOutGenWarn { get; }` | `CutFailures.CannotCutInstanceOutGenWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCutInstanceOutWarn { get; }` | `CutFailures.CannotCutInstanceOutWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCutJoinedElement { get; }` | `CutFailures.CannotCutJoinedElement` | FailureDefinitionId |
| `FailureDefinitionId CannotCutRoof { get; }` | `CutFailures.CannotCutRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotCutRoofError { get; }` | `CutFailures.CannotCutRoofError` | FailureDefinitionId |
| `FailureDefinitionId CantCutHostWithInstance { get; }` | `CutFailures.CantCutHostWithInstance` | FailureDefinitionId |
| `FailureDefinitionId CutExactlyHalf { get; }` | `CutFailures.CutExactlyHalf` | FailureDefinitionId |
| `FailureDefinitionId CutoutNotCuttingAnything { get; }` | `CutFailures.CutoutNotCuttingAnything` | FailureDefinitionId |
| `FailureDefinitionId CutoutNotCuttingAnythingDeleteOpening { get; }` | `CutFailures.CutoutNotCuttingAnythingDeleteOpening` | FailureDefinitionId |
| `FailureDefinitionId DormerCutProblem { get; }` | `CutFailures.DormerCutProblem` | FailureDefinitionId |
| `FailureDefinitionId DormerCutProblemWarn { get; }` | `CutFailures.DormerCutProblemWarn` | FailureDefinitionId |
| `FailureDefinitionId HostCutoutForInsertionFailure { get; }` | `CutFailures.HostCutoutForInsertionFailure` | FailureDefinitionId |
| `FailureDefinitionId InstanceNotCuttingAnything { get; }` | `CutFailures.InstanceNotCuttingAnything` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```